In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("data_science_student_marks.csv")
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
0,4,Sydney,24,95,99,87,82,75
1,5,Tokyo,24,99,95,89,86,82
2,6,Berlin,22,72,70,99,79,77
3,7,London,23,97,90,74,72,85
4,8,Tokyo,22,91,71,79,80,75
...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88
493,497,Los Angeles,20,90,100,90,78,73
494,498,Paris,22,78,80,78,71,70
495,499,Los Angeles,21,96,93,78,78,82
496,500,London,22,85,87,93,70,86

In [13]:
#correlation obetween all columns in number cous we have string
df.select_dtypes(include="number").corr()

,student_id,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks
student_id,1.000000,-0.070653,-0.050183,-0.037918,0.012564,-0.008111,0.018404
age,-0.070653,1.000000,0.012321,-0.035452,-0.046162,0.055126,-0.026927
sql_marks,-0.050183,0.012321,1.000000,-0.022717,-0.026660,-0.009669,-0.034080
excel_marks,-0.037918,-0.035452,-0.022717,1.000000,0.011734,0.029520,-0.042605
python_marks,0.012564,-0.046162,-0.026660,0.011734,1.000000,-0.009213,-0.121632
power_bi_marks,-0.008111,0.055126,-0.009669,0.029520,-0.009213,1.000000,0.037626
english_marks,0.018404,-0.026927,-0.034080,-0.042605,-0.121632,0.037626,1.000000

In [14]:
#correlation between two columns age and sql_marks
df["age"].corr(df["sql_marks"])

np.float64(0.012321278889055631)

In [8]:
#correlation only in object
df.select_dtypes(include="object")

        location
0         Sydney
1          Tokyo
2         Berlin
3         London
4          Tokyo
..           ...
492     New York
493  Los Angeles
494        Paris
495  Los Angeles
496       London

[497 rows x 1 columns]

In [15]:
#correlation between 3 columns age,sql_marks and excel_marks
df[["age","sql_marks","excel_marks"]].corr()

                  age  sql_marks  excel_marks
age          1.000000   0.012321    -0.035452
sql_marks    0.012321   1.000000    -0.022717
excel_marks -0.035452  -0.022717     1.000000

In [20]:
df["total"] = df["sql_marks"] + df["excel_marks"] + df["python_marks"] +df["power_bi_marks"] +df["english_marks"]
df

,student_id,location,age,sql_marks,excel_marks,python_marks,power_bi_marks,english_marks,total
0,4,Sydney,24,95,99,87,82,75,438
1,5,Tokyo,24,99,95,89,86,82,451
2,6,Berlin,22,72,70,99,79,77,397
3,7,London,23,97,90,74,72,85,418
4,8,Tokyo,22,91,71,79,80,75,396
...,...,...,...,...,...,...,...,...,...
492,496,New York,23,71,92,98,78,88,427
493,497,Los Angeles,20,90,100,90,78,73,431
494,498,Paris,22,78,80,78,71,70,377
495,499,Los Angeles,21,96,93,78,78,82,427
496,500,London,22,85,87,93,70,86,421

In [21]:
df.groupby('location')['total'].mean()

location
Berlin         420.134615
London         427.804348
Los Angeles    423.116667
Melbourne      425.396552
New York       427.122807
Paris          422.945455
Sydney         425.792453
Tokyo          427.466667
Toronto        423.553571
Name: total, dtype: float64

In [22]:
df["location"].value_counts()

location
Tokyo          60
Los Angeles    60
Melbourne      58
New York       57
Toronto        56
Paris          55
Sydney         53
Berlin         52
London         46
Name: count, dtype: int64

In [23]:
df.groupby("location").size()

location
Berlin         52
London         46
Los Angeles    60
Melbourne      58
New York       57
Paris          55
Sydney         53
Tokyo          60
Toronto        56
dtype: int64